zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/MK82FN256VLQ15-pinctrl.h
#define LLWU_P14_PTD4 KINETIS_MUX('D',4,1) /* PTD4 */
#define PTD4 KINETIS_MUX('D',4,1) /* PTD4 */
#define SPI0_PCS1_PTD4 KINETIS_MUX('D',4,2) /* PTD4 */
#define LPUART0_RTS_b_PTD4 KINETIS_MUX('D',4,3) /* PTD4 */
#define FTM0_CH4_PTD4 KINETIS_MUX('D',4,4) /* PTD4 */
#define SDRAM_A10_PTD4 KINETIS_MUX('D',4,5) /* PTD4 */
#define EWM_IN_PTD4 KINETIS_MUX('D',4,6) /* PTD4 */
#define SPI1_PCS0_PTD4 KINETIS_MUX('D',4,7) /* PTD4 */
#define ADC0_SE6b_PTD5 KINETIS_MUX('D',5,0) /* PTD5 */
#define PTD5 KINETIS_MUX('D',5,1) /* PTD5 */
#define SPI0_PCS2_PTD5 KINETIS_MUX('D',5,2) /* PTD5 */
#define LPUART0_CTS_b_PTD5 KINETIS_MUX('D',5,3) /* PTD5 */
#define FTM0_CH5_PTD5 KINETIS_MUX('D',5,4) /* PTD5 */
#define SDRAM_A9_PTD5 KINETIS_MUX('D',5,5) /* PTD5 */
#define EWM_OUT_b_PTD5 KINETIS_MUX('D',5,6) /* PTD5 */
#define SPI1_SCK_PTD5 KINETIS_MUX('D',5,7) /* PTD5 */
#define ADC0_SE7b_PTD6 KINETIS_MUX('D',6,0) /* PTD6 */
#define PTD6 KINETIS_MUX('D',6,1) /* PTD6 */
#define LLWU_P15_PTD6 KINETIS_MUX('D',6,1) /* PTD6 */
#define SPI0_PCS3_PTD6 KINETIS_MUX('D',6,2) /* PTD6 */
#define LPUART0_RX_PTD6 KINETIS_MUX('D',6,3) /* PTD6 */
#define FTM0_CH6_PTD6 KINETIS_MUX('D',6,4) /* PTD6 */
#define FTM0_FLT0_PTD6 KINETIS_MUX('D',6,6) /* PTD6 */
#define SPI1_SOUT_PTD6 KINETIS_MUX('D',6,7) /* PTD6 */
#define PTD7 KINETIS_MUX('D',7,1) /* PTD7 */
#define CMT_IRO_PTD7 KINETIS_MUX('D',7,2) /* PTD7 */
#define LPUART0_TX_PTD7 KINETIS_MUX('D',7,3) /* PTD7 */
#define FTM0_CH7_PTD7 KINETIS_MUX('D',7,4) /* PTD7 */
#define SDRAM_CKE_PTD7 KINETIS_MUX('D',7,5) /* PTD7 */
#define FTM0_FLT1_PTD7 KINETIS_MUX('D',7,6) /* PTD7 */
#define SPI1_SIN_PTD7 KINETIS_MUX('D',7,7) /* PTD7 */
#define LLWU_P24_PTD8 KINETIS_MUX('D',8,1) /* PTD8 */
#define PTD8 KINETIS_MUX('D',8,1) /* PTD8 */
#define I2C0_SCL_PTD8 KINETIS_MUX('D',8,2) /* PTD8 */
#define FXIO0_D24_PTD8 KINETIS_MUX('D',8,7) /* PTD8 */
#define PTD9 KINETIS_MUX('D',9,1) /* PTD9 */
#define I2C0_SDA_PTD9 KINETIS_MUX('D',9,2) /* PTD9 */
#define FXIO0_D25_PTD9 KINETIS_MUX('D',9,7) /* PTD9 */
#define PTD10 KINETIS_MUX('D',10,1) /* PTD10 */
#define FXIO0_D26_PTD10 KINETIS_MUX('D',10,7) /* PTD10 */
#define PTD11 KINETIS_MUX('D',11,1) /* PTD11 */
#define LLWU_P25_PTD11 KINETIS_MUX('D',11,1) /* PTD11 */
#define SPI2_PCS0_PTD11 KINETIS_MUX('D',11,2) /* PTD11 */
#define FXIO0_D27_PTD11 KINETIS_MUX('D',11,7) /* PTD11 */
#define PTD12 KINETIS_MUX('D',12,1) /* PTD12 */
#define SPI2_SCK_PTD12 KINETIS_MUX('D',12,2) /* PTD12 */
#define FTM3_FLT0_PTD12 KINETIS_MUX('D',12,3) /* PTD12 */
#define FXIO0_D28_PTD12 KINETIS_MUX('D',12,7) /* PTD12 */
#define PTD13 KINETIS_MUX('D',13,1) /* PTD13 */
#define SPI2_SOUT_PTD13 KINETIS_MUX('D',13,2) /* PTD13 */
#define FXIO0_D29_PTD13 KINETIS_MUX('D',13,7) /* PTD13 */
#define PTD14 KINETIS_MUX('D',14,1) /* PTD14 */
#define SPI2_SIN_PTD14 KINETIS_MUX('D',14,2) /* PTD14 */
#define FXIO0_D30_PTD14 KINETIS_MUX('D',14,7) /* PTD14 */
#define PTD15 KINETIS_MUX('D',15,1) /* PTD15 */
#define SPI2_PCS1_PTD15 KINETIS_MUX('D',15,2) /* PTD15 */
#define FXIO0_D31_PTD15 KINETIS_MUX('D',15,7) /* PTD15 */
#define PTE0 KINETIS_MUX('E',0,1) /* PTE0 */
#define SPI1_PCS1_PTE0 KINETIS_MUX('E',0,2) /* PTE0 */
#define LPUART1_TX_PTE0 KINETIS_MUX('E',0,3) /* PTE0 */
#define SDHC0_D1_PTE0 KINETIS_MUX('E',0,4) /* PTE0 */
#define QSPI0A_DATA3_PTE0 KINETIS_MUX('E',0,5) /* PTE0 */
#define I2C1_SDA_PTE0 KINETIS_MUX('E',0,6) /* PTE0 */
#define RTC_CLKOUT_PTE0 KINETIS_MUX('E',0,7) /* PTE0 */
#define PTE1 KINETIS_MUX('E',1,1) /* PTE1 */
#define LLWU_P0_PTE1 KINETIS_MUX('E',1,1) /* PTE1 */
#define SPI1_SCK_PTE1 KINETIS_MUX('E',1,2) /* PTE1 */
#define LPUART1_RX_PTE1 KINETIS_MUX('E',1,3) /* PTE1 */
#define SDHC0_D0_PTE1 KINETIS_MUX('E',1,4) /* PTE1 */
#define QSPI0A_SCLK_PTE1 KINETIS_MUX('E',1,5) /* PTE1 */
#define I2C1_SCL_PTE1 KINETIS_MUX('E',1,6) /* PTE1 */
#define SPI1_SIN_PTE1 KINETIS_MUX('E',1,7) /* PTE1 */
#define LLWU_P1_PTE2 KINETIS_MUX('E',2,1) /* PTE2 */
#define PTE2 KINETIS_MUX('E',2,1) /* PTE2 */
#define SPI1_SOUT_PTE2 KINETIS_MUX('E',2,2) /* PTE2 */
#define LPUART1_CTS_b_PTE2 KINETIS_MUX('E',2,3) /* PTE2 */
#define SDHC0_DCLK_PTE2 KINETIS_MUX('E',2,4) /* PTE2 */
#define QSPI0A_DATA0_PTE2 KINETIS_MUX('E',2,5) /* PTE2 */
#define SPI1_SCK_PTE2 KINETIS_MUX('E',2,7) /* PTE2 */
#define PTE3 KINETIS_MUX('E',3,1) /* PTE3 */
#define SPI1_PCS2_PTE3 KINETIS_MUX('E',3,2) /* PTE3 */
#define LPUART1_RTS_b_PTE3 KINETIS_MUX('E',3,3) /* PTE3 */
#define SDHC0_CMD_PTE3 KINETIS_MUX('E',3,4) /* PTE3 */
#define QSPI0A_DATA2_PTE3 KINETIS_MUX('E',3,5) /* PTE3 */
#define SPI1_SOUT_PTE3 KINETIS_MUX('E',3,7) /* PTE3 */
#define PTE4 KINETIS_MUX('E',4,1) /* PTE4 */
#define LLWU_P2_PTE4 KINETIS_MUX('E',4,1) /* PTE4 */
#define SPI1_SIN_PTE4 KINETIS_MUX('E',4,2) /* PTE4 */
#define LPUART3_TX_PTE4 KINETIS_MUX('E',4,3) /* PTE4 */
#define SDHC0_D3_PTE4 KINETIS_MUX('E',4,4) /* PTE4 */
#define QSPI0A_DATA1_PTE4 KINETIS_MUX('E',4,5) /* PTE4 */
#define PTE5 KINETIS_MUX('E',5,1) /* PTE5 */
#define SPI1_PCS0_PTE5 KINETIS_MUX('E',5,2) /* PTE5 */
#define LPUART3_RX_PTE5 KINETIS_MUX('E',5,3) /* PTE5 */
#define SDHC0_D2_PTE5 KINETIS_MUX('E',5,4) /* PTE5 */
#define QSPI0A_SS0_B_PTE5 KINETIS_MUX('E',5,5) /* PTE5 */
#define FTM3_CH0_PTE5 KINETIS_MUX('E',5,6) /* PTE5 */
#define USB0_SOF_OUT_PTE5 KINETIS_MUX('E',5,7) /* PTE5 */
#define LLWU_P16_PTE6 KINETIS_MUX('E',6,1) /* PTE6 */
#define PTE6 KINETIS_MUX('E',6,1) /* PTE6 */
#define SPI1_PCS3_PTE6 KINETIS_MUX('E',6,2) /* PTE6 */
#define LPUART3_CTS_b_PTE6 KINETIS_MUX('E',6,3) /* PTE6 */
#define I2S0_MCLK_PTE6 KINETIS_MUX('E',6,4) /* PTE6 */
#define QSPI0B_DATA3_PTE6 KINETIS_MUX('E',6,5) /* PTE6 */
#define FTM3_CH1_PTE6 KINETIS_MUX('E',6,6) /* PTE6 */
#define SDHC0_D4_PTE6 KINETIS_MUX('E',6,7) /* PTE6 */
#define PTE7 KINETIS_MUX('E',7,1) /* PTE7 */
#define SPI2_SCK_PTE7 KINETIS_MUX('E',7,2) /* PTE7 */
#define LPUART3_RTS_b_PTE7 KINETIS_MUX('E',7,3) /* PTE7 */
#define I2S0_RXD0_PTE7 KINETIS_MUX('E',7,4) /* PTE7 */
#define QSPI0B_SCLK_PTE7 KINETIS_MUX('E',7,5) /* PTE7 */
#define FTM3_CH2_PTE7 KINETIS_MUX('E',7,6) /* PTE7 */
#define QSPI0A_SS1_B_PTE7 KINETIS_MUX('E',7,7) /* PTE7 */
#define PTE8 KINETIS_MUX('E',8,1) /* PTE8 */
#define I2S0_RXD1_PTE8 KINETIS_MUX('E',8,2) /* PTE8 */
#define SPI2_SOUT_PTE8 KINETIS_MUX('E',8,3) /* PTE8 */
#define I2S0_RX_FS_PTE8 KINETIS_MUX('E',8,4) /* PTE8 */
#define QSPI0B_DATA0_PTE8 KINETIS_MUX('E',8,5) /* PTE8 */
#define FTM3_CH3_PTE8 KINETIS_MUX('E',8,6) /* PTE8 */
#define SDHC0_D5_PTE8 KINETIS_MUX('E',8,7) /* PTE8 */
#define LLWU_P17_PTE9 KINETIS_MUX('E',9,1) /* PTE9 */
#define PTE9 KINETIS_MUX('E',9,1) /* PTE9 */
#define I2S0_TXD1_PTE9 KINETIS_MUX('E',9,2) /* PTE9 */
#define SPI2_PCS1_PTE9 KINETIS_MUX('E',9,3) /* PTE9 */
#define I2S0_RX_BCLK_PTE9 KINETIS_MUX('E',9,4) /* PTE9 */
#define QSPI0B_DATA2_PTE9 KINETIS_MUX('E',9,5) /* PTE9 */
#define FTM3_CH4_PTE9 KINETIS_MUX('E',9,6) /* PTE9 */
#define SDHC0_D6_PTE9 KINETIS_MUX('E',9,7) /* PTE9 */
#define LLWU_P18_PTE10 KINETIS_MUX('E',10,1) /* PTE10 */
#define PTE10 KINETIS_MUX('E',10,1) /* PTE10 */
#define I2C3_SDA_PTE10 KINETIS_MUX('E',10,2) /* PTE10 */
#define SPI2_SIN_PTE10 KINETIS_MUX('E',10,3) /* PTE10 */
#define I2S0_TXD0_PTE10 KINETIS_MUX('E',10,4) /* PTE10 */
#define QSPI0B_DATA1_PTE10 KINETIS_MUX('E',10,5) /* PTE10 */
#define FTM3_CH5_PTE10 KINETIS_MUX('E',10,6) /* PTE10 */
#define SDHC0_D7_PTE10 KINETIS_MUX('E',10,7) /* PTE10 */
#define PTE11 KINETIS_MUX('E',11,1) /* PTE11 */
#define I2C3_SCL_PTE11 KINETIS_MUX('E',11,2) /* PTE11 */
#define SPI2_PCS0_PTE11 KINETIS_MUX('E',11,3) /* PTE11 */
#define I2S0_TX_FS_PTE11 KINETIS_MUX('E',11,4) /* PTE11 */
#define QSPI0B_SS0_B_PTE11 KINETIS_MUX('E',11,5) /* PTE11 */
#define FTM3_CH6_PTE11 KINETIS_MUX('E',11,6) /* PTE11 */
#define QSPI0A_DQS_PTE11 KINETIS_MUX('E',11,7) /* PTE11 */
#define PTE12 KINETIS_MUX('E',12,1) /* PTE12 */
#define LPUART2_TX_PTE12 KINETIS_MUX('E',12,3) /* PTE12 */
#define I2S0_TX_BCLK_PTE12 KINETIS_MUX('E',12,4) /* PTE12 */
#define QSPI0B_DQS_PTE12 KINETIS_MUX('E',12,5) /* PTE12 */
#define FTM3_CH7_PTE12 KINETIS_MUX('E',12,6) /* PTE12 */
#define FXIO0_D2_PTE12 KINETIS_MUX('E',12,7) /* PTE12 */
#define PTE13 KINETIS_MUX('E',13,1) /* PTE13 */
#define LPUART2_RX_PTE13 KINETIS_MUX('E',13,3) /* PTE13 */
#define QSPI0B_SS1_B_PTE13 KINETIS_MUX('E',13,5) /* PTE13 */
#define SDHC0_CLKIN_PTE13 KINETIS_MUX('E',13,6) /* PTE13 */
#define FXIO0_D3_PTE13 KINETIS_MUX('E',13,7) /* PTE13 */
#define ADC0_SE4a_PTE16 KINETIS_MUX('E',16,0) /* PTE16 */
#define PTE16 KINETIS_MUX('E',16,1) /* PTE16 */
#define SPI0_PCS0_PTE16 KINETIS_MUX('E',16,2) /* PTE16 */
#define LPUART2_TX_PTE16 KINETIS_MUX('E',16,3) /* PTE16 */
#define FTM_CLKIN0_PTE16 KINETIS_MUX('E',16,4) /* PTE16 */
#define FTM0_FLT3_PTE16 KINETIS_MUX('E',16,6) /* PTE16 */
#define FXIO0_D4_PTE16 KINETIS_MUX('E',16,7) /* PTE16 */
#define ADC0_SE5a_PTE17 KINETIS_MUX('E',17,0) /* PTE17 */
#define LLWU_P19_PTE17 KINETIS_MUX('E',17,1) /* PTE17 */
#define PTE17 KINETIS_MUX('E',17,1) /* PTE17 */
#define SPI0_SCK_PTE17 KINETIS_MUX('E',17,2) /* PTE17 */
#define LPUART2_RX_PTE17 KINETIS_MUX('E',17,3) /* PTE17 */
#define FTM_CLKIN1_PTE17 KINETIS_MUX('E',17,4) /* PTE17 */
#define LPTMR1_ALT3_PTE17 KINETIS_MUX('E',17,6) /* PTE17 */
#define LPTMR0_ALT3_PTE17 KINETIS_MUX('E',17,6) /* PTE17 */
#define FXIO0_D5_PTE17 KINETIS_MUX('E',17,7) /* PTE17 */
#define ADC0_SE6a_PTE18 KINETIS_MUX('E',18,0) /* PTE18 */
#define PTE18 KINETIS_MUX('E',18,1) /* PTE18 */
#define LLWU_P20_PTE18 KINETIS_MUX('E',18,1) /* PTE18 */
#define SPI0_SOUT_PTE18 KINETIS_MUX('E',18,2) /* PTE18 */
#define LPUART2_CTS_b_PTE18 KINETIS_MUX('E',18,3) /* PTE18 */
#define I2C0_SDA_PTE18 KINETIS_MUX('E',18,4) /* PTE18 */
#define FXIO0_D6_PTE18 KINETIS_MUX('E',18,7) /* PTE18 */
#define ADC0_SE7a_PTE19 KINETIS_MUX('E',19,0) /* PTE19 */
#define PTE19 KINETIS_MUX('E',19,1) /* PTE19 */
#define SPI0_SIN_PTE19 KINETIS_MUX('E',19,2) /* PTE19 */
#define LPUART2_RTS_b_PTE19 KINETIS_MUX('E',19,3) /* PTE19 */
#define I2C0_SCL_PTE19 KINETIS_MUX('E',19,4) /* PTE19 */
#define FXIO0_D7_PTE19 KINETIS_MUX('E',19,7) /* PTE19 */
#endif
